nxp-mcuxpresso/mcux-sdk/boards/twrkm35z75m/project_template/pin_mux.c
/*
 * Copyright 2019 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MKM35Z512xxx7
package_id: MKM35Z512VLQ7
mcu_data: ksdk2_0
processor_version: 0.0.1
board: TWR-KM35Z75M
pin_labels:
- {pin_num: '113', pin_signal: LCD_P10/PTG3/SPI0_SCK/I2C0_SCL, label: 'J32[B7]/J12[1]/U4[6]/SPI0_SCK', identifier: FLASH_CLK}
- {pin_num: '112', pin_signal: LCD_P9/ADC0_SE11/PTG2/LLWU_P1/SPI0_PCS0, label: 'J32[B9]/J9[2]/U4[1]/SPI0_PCS0', identifier: FLASH_CS}
- {pin_num: '114', pin_signal: LCD_P11/PTG4/SPI0_MOSI/I2C0_SDA, label: 'J32[B10]/J15[1]/U4[5]/SPI0_MOSI', identifier: FLASH_SI}
- {pin_num: '115', pin_signal: LCD_P12/PTG5/SPI0_MISO/LPTMR0_ALT2, label: 'J32[B11]/J13[2]/U4[2]/SPI0_MISO', identifier: FLASH_SO}
- {pin_num: '125', pin_signal: PTH7/UART1_RTS_b/SPI1_SCK/XBAR_OUT7, label: 'J32[B21]'}
- {pin_num: '130', pin_signal: LCD_P21/PTI2/LLWU_P22/LPUART0_RX, label: 'J32[B23]'}
- {pin_num: '91', pin_signal: PTE5/LLWU_P6/QTMR0_TMR3/UART2_RTS_b/EWM_OUT_b, label: 'J32[B35]'}
- {pin_num: '102', pin_signal: LCD_P4/PTF5/SPI1_MISO/I2C1_SCL, label: 'J32[B44]/J23[9]/J25[14]/SPI1_MISO'}
- {pin_num: '103', pin_signal: LCD_P5/PTF6/LLWU_P3/SPI1_MOSI/I2C1_SDA, label: 'J32[B45]/J23[10]/J25[13]/SPI1_MOSI'}
- {pin_num: '100', pin_signal: LCD_P2/PTF3/LLWU_P20/SPI1_PCS0/LPTMR0_ALT2/UART0_RX, label: 'J32[B46]/J23[11]/J25[16]/SPI1_PCS0'}
- {pin_num: '101', pin_signal: LCD_P3/PTF4/SPI1_SCK/LPTMR0_ALT1/UART0_TX, label: 'J32[B48]/J23[12]/J25[15]/SPI1_SCK'}
- {pin_num: '118', pin_signal: LCD_P15/PTH0/LPUART0_CTS_b, label: 'J32[B55]/J32[B56]'}
- {pin_num: '119', pin_signal: LCD_P16/PTH1/LPUART0_RTS_b, label: 'J32[B57]/J32[B58]'}
- {pin_num: '120', pin_signal: LCD_P17/PTH2/LPUART0_RX, label: 'J32[B59]/J32[B60]'}
- {pin_num: '121', pin_signal: LCD_P18/PTH3/LPUART0_TX, label: 'J32[B61]/J32[B62]'}
- {pin_num: '79', pin_signal: CMP0_IN4/PTD7/LLWU_P7/I2C0_SCL/XBAR_IN4/UART3_RX, label: 'J32[A7]/J10[1]/U5[4]/I2C0_SCL', identifier: ACCEL_SCL}
- {pin_num: '80', pin_signal: PTE0/I2C0_SDA/XBAR_OUT4/UART3_TX/CLKOUT, label: 'J32[A8]/J11[1]/U5[6]/I2C0_SDA', identifier: ACCEL_SDA}
- {pin_num: '124', pin_signal: PTH6/UART1_CTS_b/SPI1_PCS0/XBAR_IN7, label: 'J32[A9]'}
- {pin_num: '90', pin_signal: PTE4/LPTMR0_ALT1/UART2_CTS_b/EWM_IN, label: 'J32[A35]'}
- {pin_num: '126', pin_signal: CMP0_IN5/PTI0/LLWU_P21/UART1_RX/XBAR_IN8/SPI1_MISO/SPI1_MOSI, label: 'J32[A43]'}
- {pin_num: '127', pin_signal: PTI1/UART1_TX/XBAR_OUT8/SPI1_MOSI/SPI1_MISO, label: 'J32[A44]'}
- {pin_num: '65', pin_signal: CMP0_IN1/PTD2/LLWU_P10/UART1_RX/SPI0_SCK/XBAR_IN3, label: 'J32[A63]'}
- {pin_num: '83', pin_signal: PTE1/RESET_b, label: 'J28[2]/J22[20]/J24[10]', identifier: RESET}
- {pin_num: '7', pin_signal: LCD_P47/PTI7/UART2_TX, label: UART2_TX, identifier: DEBUG_UART_TX}
- {pin_num: '6', pin_signal: LCD_P46/PTI6/UART2_RX, label: UART2_RX, identifier: DEBUG_UART_RX}
- {pin_num: '66', pin_signal: PTJ5/LPUART0_TX, label: 'J14[1]/U5[11]/INT1', identifier: ACCEL_INT1}
- {pin_num: '67', pin_signal: PTJ6/LLWU_P18/LPUART0_RX, label: 'J16[1]/U5[9]/INT2', identifier: ACCEL_INT2}
- {pin_num: '62', pin_signal: PTJ3/LPUART0_RTS_b/CMP2_OUT, label: D3/GRN, identifier: LED_GREEN}
- {pin_num: '63', pin_signal: PTJ4/LPUART0_CTS_b/LPTMR1_ALT1, label: D4/RED, identifier: LED_RED}
- {pin_num: '61', pin_signal: CMP0_IN0/PTD0/LLWU_P11/UART0_RX/XBAR_IN2, label: 'J17[2]/J19[1]/J25[17]/D5/ORANGE/IRDRJ/CMP0_IN0', identifier: LED_ORANGE;IR_RX}
- {pin_num: '26', pin_signal: LCD_P38/PTB7/AFE_CLK, label: 'DS1[1]/LCD_P38', identifier: LCD_P38}
- {pin_num: '24', pin_signal: LCD_P36/PTB5/SPI2_MOSI, label: 'DS1[2]/LCD_P36', identifier: LCD_P36}
- {pin_num: '22', pin_signal: LCD_P34/PTB3/SPI2_SCK, label: 'DS1[3]/LCD_P34', identifier: LCD_P34}
- {pin_num: '20', pin_signal: LCD_P32/PTB1/LLWU_P17, label: 'DS1[4]/LCD_P32', identifier: LCD_P32}
- {pin_num: '16', pin_signal: LCD_P31/PTB0, label: 'DS1[5]/LCD_P31', identifier: LCD_P31}
- {pin_num: '12', pin_signal: LCD_P29/PTA6/LLWU_P14/XBAR_IN0, label: 'DS1[6]/LCD_P29', identifier: LCD_P29}
- {pin_num: '8', pin_signal: LCD_P25/PTA2, label: 'DS1[7]/LCD_P25', identifier: LCD_P25}
- {pin_num: '4', pin_signal: LCD_P23/PTA0/LLWU_P16, label: 'DS1[8]/LCD_P23', identifier: LCD_P23}
- {pin_num: '31', pin_signal: LCD_P43/PTC4, label: 'DS1[9]/LCD_P43', identifier: LCD_P43}
- {pin_num: '25', pin_signal: LCD_P37/CMP1_IN0/PTB6, label: 'DS1[10]/LCD_P37', identifier: LCD_P37}
- {pin_num: '23', pin_signal: LCD_P35/PTB4/SPI2_MISO, label: 'DS1[11]/LCD_P35', identifier: LCD_P35}
- {pin_num: '21', pin_signal: LCD_P33/PTB2/SPI2_PCS0, label: 'DS1[12]/LCD_P33', identifier: LCD_P33}
- {pin_num: '17', pin_signal: LCD_P50/PTJ2, label: 'DS1[13]/LCD_P50', identifier: LCD_P50}
- {pin_num: '13', pin_signal: LCD_P30/PTA7/XBAR_OUT0, label: 'DS1[14]/LCD_P30', identifier: LCD_P30}
- {pin_num: '117', pin_signal: LCD_P14/PTG7/LPTMR1_ALT1, label: 'DS1[28]/LCD_P14', identifier: LCD_P14}
- {pin_num: '123', pin_signal: LCD_P20/PTH5/LPTMR1_ALT3, label: 'DS1[27]/LCD_P20', identifier: LCD_P20}
- {pin_num: '131', pin_signal: LCD_P22/PTI3/LPUART0_TX/CMP2_OUT, label: 'DS1[26]/LCD_P22', identifier: LCD_P22}
- {pin_num: '139', pin_signal: LCD_P56/PTL3/EWM_IN, label: 'DS1[25]/LCD_P56', identifier: LCD_P56}
- {pin_num: '141', pin_signal: LCD_P58/PTL5/LLWU_P23, label: 'DS1[24]/LCD_P58', identifier: LCD_P58}
- {pin_num: '116', pin_signal: LCD_P13/PTG6/LLWU_P0/LPTMR0_ALT3, label: 'DS1[23]/LCD_P13', identifier: LCD_P13}
- {pin_num: '122', pin_signal: LCD_P19/PTH4/LPTMR1_ALT2, label: 'DS1[22]/LCD_P19', identifier: LCD_P19}
- {pin_num: '140', pin_signal: LCD_P57/PTL4/EWM_OUT_b, label: 'DS1[21]/LCD_P57', identifier: LCD_P57}
- {pin_num: '142', pin_signal: LCD_P59/PTL6, label: 'DS1[20]/LCD_P59', identifier: LCD_P59}
- {pin_num: '143', pin_signal: LCD_P44/PTI4, label: 'DS1[19]/LCD_P44', identifier: LCD_P44}
- {pin_num: '11', pin_signal: LCD_P28/PTA5/CMP0_OUT, label: 'DS1[18]/LCD_P28', identifier: LCD_P28}
- {pin_num: '9', pin_signal: LCD_P26/PTA3, label: 'DS1[17]/LCD_P26', identifier: LCD_P26}
- {pin_num: '5', pin_signal: LCD_P24/PTA1, label: 'DS1[16]/LCD_P24', identifier: LCD_P24}
- {pin_num: '3', pin_signal: LCD_P45/PTI5, label: 'DS1[15]/LCD_P45', identifier: LCD_P45}
- {pin_num: '10', pin_signal: LCD_P27/PTA4/LLWU_P15/NMI_b, label: SW1, identifier: SW1}
- {pin_num: '64', pin_signal: PTD1/UART1_TX/SPI0_PCS0/XBAR_OUT3/QTMR0_TMR3, label: SW2, identifier: SW2}
- {pin_num: '129', pin_signal: LCD_P55/PTL2/XBAR_OUT10, label: 'J18[1]/J25[23]/IRDTJ/XBAR0_OUT10', identifier: IR_TX}
- {pin_num: '95', pin_signal: LCD_P0/ADC0_SE8/CMP2_IN4/PTF1/QTMR0_TMR0/XBAR_OUT6, label: 'J21[1]/POT_5K', identifier: ADC_POT}
- {pin_num: '96', pin_signal: LCD_P1/ADC0_SE9/CMP2_IN5/PTF2/CMP1_OUT/RTC_CLKOUT, label: 'J20[1]/TEMP_SENSE', identifier: ADC_TEMP}
- {pin_num: '84', pin_signal: EXTAL/PTE2/EWM_IN/XBAR_IN6/I2C1_SDA, label: 'J4[2]/Y2[3]/EXTAL_8MHz', identifier: EXTAL0}
- {pin_num: '85', pin_signal: XTAL/PTE3/EWM_OUT_b/AFE_CLK/I2C1_SCL, label: 'J7[2]/Y2[1]/XTAL_8MHz', identifier: XTAL0}
- {pin_num: '34', pin_signal: EXTAL32, label: 'Y1[2]/EXTAL_32K', identifier: EXTAL_32K}
- {pin_num: '33', pin_signal: XTAL32, label: 'Y1[1]/XTAL_32K', identifier: XTAL_32K}
- {pin_num: '70', pin_signal: ADC0_SE12/PTK0/LPTMR1_ALT3, label: 'J22[12]/TWRPI-ADC2'}
- {pin_num: '75', pin_signal: ADC0_SE13/PTK1, label: 'J22[8]/TWRPI-ADC0'}
- {pin_num: '78', pin_signal: ADC0_SE5a/PTD6/LLWU_P8/LPTMR0_ALT2/CMP1_OUT/UART3_RTS_b, label: 'J22[18]/TWRPI-ID1'}
- {pin_num: '77', pin_signal: ADC0_SE4a/PTD5/LPTMR0_ALT3/QTMR0_TMR0/UART3_CTS_b, label: 'J22[17]/TWRPI-ID0'}
- {pin_num: '76', pin_signal: ADC0_SE3/PTD4/LLWU_P9/UART1_RTS_b/SPI0_MISO/LPTMR1_ALT3, label: 'J22[9]/TWRPI-ADC1'}
- {pin_num: '15', pin_signal: LCD_P49/PTJ1/I2C1_SCL, label: 'J23[3]/I2C1_SCL'}
- {pin_num: '14', pin_signal: LCD_P48/PTJ0/I2C1_SDA, label: 'J23[4]/I2C1_SDA'}
- {pin_num: '68', pin_signal: PTJ7/LPTMR1_ALT2, label: 'J23[15]'}
- {pin_num: '30', pin_signal: LCD_P42/CMP0_IN3/PTC3/LLWU_P13/UART3_RX, label: 'J23[17]/UART3_RX'}
- {pin_num: '28', pin_signal: LCD_P40/CMP1_IN1/PTC1/UART3_CTS_b, label: 'J23[19]/UART3_CTS'}
- {pin_num: '69', pin_signal: PTD3/UART1_CTS_b/SPI0_MOSI/LPTMR1_ALT2, label: 'J23[16]'}
- {pin_num: '29', pin_signal: LCD_P41/PTC2/UART3_TX/XBAR_OUT1, label: 'J23[18]/UART3_TX'}
- {pin_num: '27', pin_signal: LCD_P39/PTC0/UART3_RTS_b/XBAR_IN1/PDB0_EXTRG, label: 'J23[20]/UART3_RTS'}
- {pin_num: '99', pin_signal: PTK6/UART1_TX, label: 'J25[9]/UART1_TX'}
- {pin_num: '106', pin_signal: LCD_P53/PTL0/I2C0_SDA, label: 'J25[11]/I2C0_SDA'}
- {pin_num: '128', pin_signal: LCD_P54/PTL1/XBAR_IN10, label: 'J25[19]/XBAR0_IN10'}
- {pin_num: '97', pin_signal: LCD_P51/PTK4/XBAR_IN9/AFE_CLK, label: 'J25[21]/AFE_CLK'}
- {pin_num: '42', pin_signal: TAMPER0, label: 'J25[2]'}
- {pin_num: '41', pin_signal: TAMPER1, label: 'J25[4]'}
- {pin_num: '40', pin_signal: TAMPER2, label: 'J25[6]'}
- {pin_num: '98', pin_signal: PTK5/UART1_RX, label: 'J25[8]/UART1_RX'}
- {pin_num: '105', pin_signal: LCD_P52/PTK7/I2C0_SCL/XBAR_OUT9, label: 'J25[12]/I2C0_SCL'}
- {pin_num: '104', pin_signal: LCD_P6/PTF7/QTMR0_TMR2/CLKOUT/CMP2_OUT, label: 'J25[18]/CLKOUT'}
- {pin_num: '110', pin_signal: LCD_P7/PTG0/QTMR0_TMR1/LPTMR0_ALT3, label: 'J25[20]/QTMR0_TMR1'}
- {pin_num: '81', pin_signal: ADC0_SE14/PTK2/UART0_TX, label: 'J25[22]/UART0_TX'}
- {pin_num: '82', pin_signal: ADC0_SE15/PTK3/LLWU_P19/UART0_RX, label: 'J25[24]/UART0_RX'}
- {pin_num: '92', pin_signal: CMP0_IN2/PTE6/LLWU_P5/XBAR_IN5/UART2_RX/I2C0_SCL/SWD_DIO, label: 'J24[2]/SWD_DIO_TGTMCU'}
- {pin_num: '93', pin_signal: ADC0_SE6a/PTE7/XBAR_OUT5/UART2_TX/I2C0_SDA/SWD_CLK, label: 'J24[4]/SWD_CLK_TGTMCU'}
- {pin_num: '53', pin_signal: VREF, label: 'J2[2]/VREF'}
- {pin_num: '50', pin_signal: VREFL, label: VREFL}
- {pin_num: '49', pin_signal: VREFH, label: VREFH}
- {pin_num: '88', pin_signal: VDDA, label: VDDA}
- {pin_num: '87', pin_signal: VSSA, label: VSSA}
- {pin_num: '133', pin_signal: VDD135, label: MCU_PWR}
- {pin_num: '89', pin_signal: VDD91, label: MCU_PWR}
- {pin_num: '18', pin_signal: VDD20, label: MCU_PWR}
- {pin_num: '43', pin_signal: AFE_VDDA, label: VDDA_AFE}
- {pin_num: '44', pin_signal: AFE_VSSA, label: VSSA_AFE}
- {pin_num: '132', pin_signal: VSS134, label: GND}
- {pin_num: '39', pin_signal: VSS41, label: GND}
- {pin_num: '86', pin_signal: VSS88, label: GND}
- {pin_num: '19', pin_signal: VSS21, label: GND}
- {pin_num: '1', pin_signal: NC3, label: GND}
- {pin_num: '2', pin_signal: NC4, label: GND}
- {pin_num: '35', pin_signal: NC37, label: GND}
- {pin_num: '36', pin_signal: NC38, label: GND}
- {pin_num: '38', pin_signal: NC40, label: GND}
- {pin_num: '37', pin_signal: NC39, label: GND}
- {pin_num: '56', pin_signal: NC58, label: GND}
- {pin_num: '57', pin_signal: NC59, label: GND}
- {pin_num: '71', pin_signal: NC73, label: GND}
- {pin_num: '72', pin_signal: NC74, label: GND}
- {pin_num: '73', pin_signal: NC75, label: GND}
- {pin_num: '74', pin_signal: NC76, label: GND}
- {pin_num: '107', pin_signal: NC109, label: GND}
- {pin_num: '108', pin_signal: NC110, label: GND}
- {pin_num: '109', pin_signal: NC111, label: GND}
- {pin_num: '144', pin_signal: NC2, label: GND}
- {pin_num: '45', pin_signal: AFE_SDADP0, label: 'J31[2]/AFE_SDADP0'}
- {pin_num: '46', pin_signal: AFE_SDADM0, label: 'J31[4]/AFE_SDADM0'}
- {pin_num: '47', pin_signal: AFE_SDADP1, label: 'J31[6]/AFE_SDADP1'}
- {pin_num: '48', pin_signal: AFE_SDADM1, label: 'J31[8]/AFE_SDADM1'}
- {pin_num: '52', pin_signal: AFE_SDADM2/CMP1_IN3, label: 'J31[12]/AFE_SDADM2'}
- {pin_num: '55', pin_signal: AFE_SDADM3/CMP1_IN5, label: 'J31[16]/AFE_SDADM3'}
- {pin_num: '51', pin_signal: AFE_SDADP2/CMP1_IN2, label: 'J31[10]/AFE_SDADP2'}
- {pin_num: '54', pin_signal: AFE_SDADP3/CMP1_IN4, label: 'J31[14]/AFE_SDADP3'}
- {pin_num: '58', pin_signal: ADC0_SE0/CMP2_IN0/PTC5/LLWU_P12/UART0_RTS_b/LPTMR1_ALT1, label: 'J31[18]/ADC0_SE0'}
- {pin_num: '59', pin_signal: ADC0_SE1/CMP2_IN1/PTC6/UART0_CTS_b/QTMR0_TMR1/PDB0_EXTRG, label: 'J31[20]/ADC0_SE1'}
- {pin_num: '60', pin_signal: ADC0_SE2/CMP2_IN2/PTC7/UART0_TX/XBAR_OUT2, label: 'J31[22]/ADC0_SE2'}
- {pin_num: '32', pin_signal: VBAT, label: 'J1[2]/VBAT'}
- {pin_num: '94', pin_signal: ADC0_SE7a/CMP2_IN3/PTF0/LLWU_P4/RTC_CLKOUT/QTMR0_TMR2/CMP0_OUT, label: NC}
- {pin_num: '111', pin_signal: LCD_P8/ADC0_SE10/PTG1/LLWU_P2/LPTMR0_ALT1, label: NC}
- {pin_num: '134', pin_signal: VLL3, label: 'J33[2]/VLL3'}
- {pin_num: '136', pin_signal: VLL1/LCD_P61/PTM1, label: VLL1}
- {pin_num: '135', pin_signal: VLL2/LCD_P60/PTM0, label: VLL2}
- {pin_num: '137', pin_signal: VCAP2/LCD_P62/PTM2, label: C83/VCAP2}
- {pin_num: '138', pin_signal: VCAP1/LCD_P63/PTM3, label: C83/VCAP1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_xbar.h"
#include "pin_mux.h"

