nxp-mcuxpresso/mcux-sdk/boards/twrkm35z75m/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI_FLASHPins(void)
{
    /* PCTLG Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortG);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Open drain is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Pin is configured as SPI0_PCS0 */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTG2 (pin 112) is configured as SPI0_PCS0 */
    PORT_SetPinConfig(BOARD_FLASH_CS_PORT, BOARD_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_CLK = {/* Internal pull-up/down resistor is disabled */
                                         kPORT_PullDisable,
                                         /* Fast slew rate is configured */
                                         kPORT_FastSlewRate,
                                         /* Open drain is disabled */
                                         kPORT_OpenDrainDisable,
                                         /* Pin is configured as SPI0_SCK */
                                         kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         kPORT_UnlockRegister};
    /* PORTG3 (pin 113) is configured as SPI0_SCK */
    PORT_SetPinConfig(BOARD_FLASH_CLK_PORT, BOARD_FLASH_CLK_PIN, &FLASH_CLK);

    const port_pin_config_t FLASH_SI = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Open drain is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Pin is configured as SPI0_MOSI */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTG4 (pin 114) is configured as SPI0_MOSI */
    PORT_SetPinConfig(BOARD_FLASH_SI_PORT, BOARD_FLASH_SI_PIN, &FLASH_SI);

    const port_pin_config_t FLASH_SO = {/* Internal pull-up/down resistor is disabled */
                                        kPORT_PullDisable,
                                        /* Fast slew rate is configured */
                                        kPORT_FastSlewRate,
                                        /* Open drain is disabled */
                                        kPORT_OpenDrainDisable,
                                        /* Pin is configured as SPI0_MISO */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTG5 (pin 115) is configured as SPI0_MISO */
    PORT_SetPinConfig(BOARD_FLASH_SO_PORT, BOARD_FLASH_SO_PIN, &FLASH_SO);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitInfra_RedPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '129', peripheral: SIM, signal: UART_MOD_AND_OUT, pin_signal: LCD_P55/PTL2/XBAR_OUT10, slew_rate: fast, open_drain: disable, pull_select: down, pull_enable: disable}
  - {peripheral: SIM, signal: UART_MOD_CARR, pin_signal: RTC_CLK_Output}
  - {peripheral: SIM, signal: UART_MOD_DATA, pin_signal: UART0_TX_output}
  - {pin_num: '61', peripheral: CMP0, signal: 'IN, 0', pin_signal: CMP0_IN0/PTD0/LLWU_P11/UART0_RX/XBAR_IN2, identifier: IR_RX, slew_rate: fast, open_drain: disable,
    pull_select: down, pull_enable: disable}
  - {peripheral: UART0, signal: RX, pin_signal: CMP0_Output}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitInfra_RedPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitInfra_RedPins(void)
{
    /* PCTLD Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* PCTLL Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortL);
    /* Peripheral Crossbar Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_Xbar);

    const port_pin_config_t IR_RX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Pin is configured as CMP0_IN0 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTD0 (pin 61) is configured as CMP0_IN0 */
    PORT_SetPinConfig(BOARD_IR_RX_PORT, BOARD_IR_RX_PIN, &IR_RX);

    const port_pin_config_t IR_TX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Pin is configured as XBAR_OUT10 */
                                     kPORT_MuxAlt2,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTL2 (pin 129) is configured as XBAR_OUT10 */
    PORT_SetPinConfig(BOARD_IR_TX_PORT, BOARD_IR_TX_PIN, &IR_TX);

    SIM->MISC_CTL = ((SIM->MISC_CTL &
                      /* Mask bits to zero which are setting */
                      (~(SIM_MISC_CTL_UARTMODTYPE_MASK | SIM_MISC_CTL_UART0IRSEL_MASK)))

