nxp-mcuxpresso/mcux-sdk/boards/twrkm35z75m/project_template/pin_mux.c
    const port_pin_config_t LCD_P30 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P30 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTA7 (pin 13) is configured as LCD_P30 */
    PORT_SetPinConfig(BOARD_LCD_P30_PORT, BOARD_LCD_P30_PIN, &LCD_P30);

    const port_pin_config_t LCD_P31 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P31 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB0 (pin 16) is configured as LCD_P31 */
    PORT_SetPinConfig(BOARD_LCD_P31_PORT, BOARD_LCD_P31_PIN, &LCD_P31);

    const port_pin_config_t LCD_P32 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P32 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB1 (pin 20) is configured as LCD_P32 */
    PORT_SetPinConfig(BOARD_LCD_P32_PORT, BOARD_LCD_P32_PIN, &LCD_P32);

    const port_pin_config_t LCD_P33 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P33 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB2 (pin 21) is configured as LCD_P33 */
    PORT_SetPinConfig(BOARD_LCD_P33_PORT, BOARD_LCD_P33_PIN, &LCD_P33);

    const port_pin_config_t LCD_P34 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P34 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB3 (pin 22) is configured as LCD_P34 */
    PORT_SetPinConfig(BOARD_LCD_P34_PORT, BOARD_LCD_P34_PIN, &LCD_P34);

    const port_pin_config_t LCD_P35 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P35 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB4 (pin 23) is configured as LCD_P35 */
    PORT_SetPinConfig(BOARD_LCD_P35_PORT, BOARD_LCD_P35_PIN, &LCD_P35);

    const port_pin_config_t LCD_P36 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P36 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB5 (pin 24) is configured as LCD_P36 */
    PORT_SetPinConfig(BOARD_LCD_P36_PORT, BOARD_LCD_P36_PIN, &LCD_P36);

    const port_pin_config_t LCD_P37 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P37 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB6 (pin 25) is configured as LCD_P37 */
    PORT_SetPinConfig(BOARD_LCD_P37_PORT, BOARD_LCD_P37_PIN, &LCD_P37);

    const port_pin_config_t LCD_P38 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P38 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTB7 (pin 26) is configured as LCD_P38 */
    PORT_SetPinConfig(BOARD_LCD_P38_PORT, BOARD_LCD_P38_PIN, &LCD_P38);

    const port_pin_config_t LCD_P43 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P43 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTC4 (pin 31) is configured as LCD_P43 */
    PORT_SetPinConfig(BOARD_LCD_P43_PORT, BOARD_LCD_P43_PIN, &LCD_P43);

    const port_pin_config_t LCD_P13 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P13 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTG6 (pin 116) is configured as LCD_P13 */
    PORT_SetPinConfig(BOARD_LCD_P13_PORT, BOARD_LCD_P13_PIN, &LCD_P13);

    const port_pin_config_t LCD_P14 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P14 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTG7 (pin 117) is configured as LCD_P14 */
    PORT_SetPinConfig(BOARD_LCD_P14_PORT, BOARD_LCD_P14_PIN, &LCD_P14);

    const port_pin_config_t LCD_P19 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P19 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTH4 (pin 122) is configured as LCD_P19 */
    PORT_SetPinConfig(BOARD_LCD_P19_PORT, BOARD_LCD_P19_PIN, &LCD_P19);

    const port_pin_config_t LCD_P20 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P20 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTH5 (pin 123) is configured as LCD_P20 */
    PORT_SetPinConfig(BOARD_LCD_P20_PORT, BOARD_LCD_P20_PIN, &LCD_P20);

