nxp-mcuxpresso/mcux-sdk/boards/twrkm35z75m/project_template/pin_mux.c
    const port_pin_config_t LCD_P22 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P22 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTI3 (pin 131) is configured as LCD_P22 */
    PORT_SetPinConfig(BOARD_LCD_P22_PORT, BOARD_LCD_P22_PIN, &LCD_P22);

    const port_pin_config_t LCD_P44 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P44 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTI4 (pin 143) is configured as LCD_P44 */
    PORT_SetPinConfig(BOARD_LCD_P44_PORT, BOARD_LCD_P44_PIN, &LCD_P44);

    const port_pin_config_t LCD_P45 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P45 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTI5 (pin 3) is configured as LCD_P45 */
    PORT_SetPinConfig(BOARD_LCD_P45_PORT, BOARD_LCD_P45_PIN, &LCD_P45);

    const port_pin_config_t LCD_P50 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P50 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTJ2 (pin 17) is configured as LCD_P50 */
    PORT_SetPinConfig(BOARD_LCD_P50_PORT, BOARD_LCD_P50_PIN, &LCD_P50);

    const port_pin_config_t LCD_P56 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P56 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTL3 (pin 139) is configured as LCD_P56 */
    PORT_SetPinConfig(BOARD_LCD_P56_PORT, BOARD_LCD_P56_PIN, &LCD_P56);

    const port_pin_config_t LCD_P57 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P57 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTL4 (pin 140) is configured as LCD_P57 */
    PORT_SetPinConfig(BOARD_LCD_P57_PORT, BOARD_LCD_P57_PIN, &LCD_P57);

    const port_pin_config_t LCD_P58 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P58 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTL5 (pin 141) is configured as LCD_P58 */
    PORT_SetPinConfig(BOARD_LCD_P58_PORT, BOARD_LCD_P58_PIN, &LCD_P58);

    const port_pin_config_t LCD_P59 = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Open drain is disabled */
                                       kPORT_OpenDrainDisable,
                                       /* Pin is configured as LCD_P59 */
                                       kPORT_PinDisabledOrAnalog,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       kPORT_UnlockRegister};
    /* PORTL6 (pin 142) is configured as LCD_P59 */
    PORT_SetPinConfig(BOARD_LCD_P59_PORT, BOARD_LCD_P59_PIN, &LCD_P59);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
